gilphilbert/kids-nfc-player/lib/ESP32-audioI2S/src/Audio.cpp
    // c99 has no inner functions, lambdas are only allowed from c11, please don't use ancient compiler
    auto atomItems = [&](uint32_t startPos){    // lambda, inner function
        char tmp[5];
        audiofile.seek(startPos);
        audiofile.readBytes(tmp, 4);
        atom.size = bigEndian((uint8_t*)tmp, 4);
        audiofile.readBytes(atom.name, 4);
        atom.name[4] = '\0';
        atom.pos = startPos;
        return atom;
    };
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    boolean found      = false;
    uint32_t seekpos   = 0;
    uint32_t filesize  = getFileSize();
    char name[6][5]    = {"moov", "trak", "mdia", "minf", "stbl", "stsz"};
    char noe[4];

    if(!audiofile) return; // guard

    at.pos = 0;
    at.size = filesize;
    seekpos = 0;

    for(int i = 0; i< 6; i++){
        found = false;
        while(seekpos < at.pos + at.size){
            tmp = atomItems(seekpos);
            seekpos += tmp.size;
            if(strcmp(tmp.name, name[i]) == 0) {memcpy((void*)&at, (void*)&tmp, sizeof(tmp)); found = true;}
            if(m_f_Log) log_i("name %s pos %d, size %d", tmp.name, tmp.pos, tmp.size);
        }
        if(!found) goto noSuccess;
        seekpos = at.pos + 8; // 4 bytes size + 4 bytes name
    }

    seekpos += 8; // 1 byte version + 3 bytes flags + 4  bytes sample size
    audiofile.seek(seekpos);
    audiofile.readBytes(noe, 4); //number of entries
    m_stsz_numEntries = bigEndian((uint8_t*)noe, 4);
    if(m_f_Log) log_i("number of entries in stsz: %d", m_stsz_numEntries);
    m_stsz_position = seekpos + 4;
    audiofile.seek(0);
    return;

noSuccess:
    m_stsz_numEntries= 0;
    m_stsz_position = 0;
    log_e("m4a atom stsz not found");
    audiofile.seek(0);
    return;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::m4a_correctResumeFilePos(uint32_t resumeFilePos){
    // In order to jump within an m4a file, the exact beginning of an aac block must be found. Since m4a cannot be
    // streamed, i.e. there is no syncword, an imprecise jump can lead to a crash.

    if(!m_stsz_position) return m_audioDataStart; // guard

    typedef union{
        uint8_t     u8[4];
        uint32_t    u32;
    } tu;
    tu uu;

    uint32_t i = 0, pos = m_audioDataStart;
    audiofile.seek(m_stsz_position);

    while(i < m_stsz_numEntries){
        i++;
        uu.u8[3] =  audiofile.read();
        uu.u8[2] =  audiofile.read();
        uu.u8[1] =  audiofile.read();
        uu.u8[0] =  audiofile.read();
        pos += uu.u32;
        if(pos >= resumeFilePos) break;
    }
    return pos;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::flac_correctResumeFilePos(uint32_t resumeFilePos){
    // The starting point is the next FLAC syncword
    uint8_t p1, p2;
    boolean found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    pos+=2;
    while(!found || pos == m_file_size){
        if(p1 == 0xFF && p2 == 0xF8){found = true; log_i("found"); break;}
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }

    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::mp3_correctResumeFilePos(uint32_t resumeFilePos){
    // The starting point is the next MP3 syncword
    uint8_t p1, p2;
    boolean found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    pos+=2;
    while(!found || pos == m_file_size){
        if(p1 == 0xFF && (p2 & 0xF0) == 0xF0){found = true; break;}
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }

    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
#endif // AUDIO_NO_SD_FS
